имя(ирена).
имя(тимур).
имя(камилла).
имя(эльдар).
имя(залим).

предмет(физика).
предмет(математика).
предмет(информатика).
предмет(литература).
предмет(география).

условие(ирена,X):-предмет(X),X\=информатика,X\=литература.
условие(тимур,X):-предмет(X),X\=информатика,X\=физика,X\=литература,X\=математика.
условие(камилла,X):-предмет(X),X\=информатика,X\=литература,X\=математика.
условие(эльдар,X):-предмет(X),X\=информатика.
условие(X,Y):-X\=ирена,X\=тимур,X\=эльдар,X\=камилла,имя(X),предмет(Y).

неравны(X1,X2,X3,X4,X5):-X1\=X2,X1\=X3,X1\=X4,X1\=X5,X2\=X3,X2\=X4,X2\=X5,X3\=X4,X3\=X5,X4\=X5.

решение(X1,Y1,X2,Y2,X3,Y3,X4,Y4,X5,Y5):-имя(X1),имя(X2),имя(X3),имя(X4),имя(X5),неравны(X1,X2,X3,X4,X5),предмет(Y1),предмет(Y2),предмет(Y3),предмет(Y4),предмет(Y5),неравны(Y1,Y2,Y3,Y4,Y5),условие(X1,Y1),условие(X2,Y2),условие(X3,Y3),условие(X4,Y4),условие(X5,Y5).